import 'package:flutter/material.dart';
class AppData{
  static List <String> departmentsTitles =[
    "الصيدلية","قسم الأسنان","قسم تقويم الأسنان","قسم الباطنيه و الصدريه", "قسم الأوعيه الدمويه",
    "قسم الجلديه والتجميل","قسم الطب العام والطوارئ","قسم النساء و الولاده","قسم الأطفال","قسم العيون",
    "قسم التغذيه","قسم العظام"
  ];
  static List <String> departmentsSubtitles =[
    "يعمل قسم الصيدلية بجمع عيادات بلغصون علي مدار 24 ساعة 7 ايام في الاسبوع ليقدم لعملائنا الكرام جميع الادوية و العلاجات و المواد التجميلية ومواد العناية بالبشرة و الجسم و غيرها الكثير .",
    "يعتبر قسم الاسنان من الاقسام المهمه لما تقدمة من خدمات متكاملة في مجال صحة الفم والاسنان ، لذلك فإن العياده تحرص على تطبيق أحدث المعايير في سياسات الجودة بالإضافة للاهتمام بعملية التعقيم وايضا الخدمات العلاجيه .",
    "يقدم قسم التقويم عيادات بلغصون الخدمات العلاجية المتكاملة في تشخيص وعلاج جميع حالات الكسور و أمراض المفاصل وإصابات العمود الفقري بالوسائل الطبية الحديثة التي تقارن مع أحدث المستشفيات العالمية بالإضافة إلى إجراء كافة أنواع العمليات الجراحية العادية والمجهرية .",
    "يعد قسم الأمراض الباطنية من اهم الأقسام في تشخيص وعلاج الامراض الباطنية لعلاج أمراض الجهاز الهضمي وامراض الكبد والكلى و الأمراض الصدرية و أمراض السكري و كذلك الفحص الطبي الشامل .",
    "يقدم قسم الاوعية الدموية في عيادات بلغصون تشخيص وعلاج جميع الامراض التي تتعلق بالاوعية الدموية وفق أسس علمية دقيقة وعلى ايدي أطباء خبراء .",
    "يهتم قسم الجلدية التجميل بتقديم افضل الخدمات التجميليه والجلديه حيث يستخدم احدث الاجهزه الطبيه(كاجهزة الليزر لازالة الشعر وتوريد الشفايف واجهزة تنظيف البشره وعمل الابر اتجمليله كالبوتكس والفيلر وابر بلازما الشعر ..) وتستخدم البرامج العلاجيه والتجميليه للحصول على افضل النتائج .",
    "يقوم قسم الطب العام والطوارئ بتشخيص وعلاج جميع الحالات المرضية لجميع الفئات العمرية وعلى مدار 24 ساعة 7 أيام في الأسبوع كما يساهم في علاج الحالات الطارئه وفق معايير طبية حديثة",
    "يهتم قسم النساء والولاده بالامراض النسائيه ومتابعة الحمل وقد تم تزويد العيادة بأحدث أجهزة التصوير بالأمواج فوق الصوتية.كما تهتم العيادة بمتابعة سكر الحمل للمريضات الحوامل و الذين يعانون من فقر الدم وعمل تخطيط لقلب الجنين ",
    "يقدم قسم الاطفال عيادات بلغصون الخدمات العلاجية المتكاملة و تقديم رعاية شاملة للأطفال حيث تعالج جميع الامراض ومتابعة مراحل النمو وعمل التطعيمات",
    "يقدم قسم العيون في مجمع عيادات بلغصون تشخيص وعلاج جميع الحالات المختصه بطب العيون من فحص النظر و علاج التهابات العيون و علاج مشاكل القرنية و الشبكية ومشاكل الحول عند الأطفال وعلاج حالات المياه البيضاء والزرقاء وتصحيح النظر وبواسطة احدذ الأجهزة والمعدات الطبية عالية الجودة .",
    "يقدم قسم التغذية في عيادات بلغصون جميع الخدمات العلاجية والنفسية والتي تساعد عملائنا على الحصول على نظام حياة صحي، ويشجع على عادات الأكل الصحيحة، كما اننا نقدم لهم برامج متنوعه لعلاج السمنة مبينة على معايير علمية دقيقة لكل حالة على حدا.كما نوفر برامج متنوعة لعلاج النحافة غير المرغوب فيها",
    "يقدم قسم العظام عيادات بلغصون الخدمات العلاجية المتكاملة في تشخيص وعلاج جميع حالات الكسور و أمراض المفاصل وإصابات العمود الفقري بالوسائل الطبية الحديثة التي تقارن مع أحدث المستشفيات العالمية بالإضافة إلى إجراء كافة أنواع العمليات الجراحية العادية والمجهرية",
  ];
  static List <String> departmentsImages =[
    "assets/images/Departments images/1.png","assets/images/Departments images/2.png",
    "assets/images/Departments images/3.png","assets/images/Departments images/4.png",
    "assets/images/Departments images/5.png","assets/images/Departments images/6.png",
    "assets/images/Departments images/7.png","assets/images/Departments images/8.png",
    "assets/images/Departments images/9.png","assets/images/Departments images/10.png",
    "assets/images/Departments images/11.png","assets/images/Departments images/12.png",
  ];

  //know your Doctor data
  static List<String>knowYourDoctorImages =[
    "assets/images/Know your doctor images/female_doctor.png",
    "assets/images/Know your doctor images/male_doctor.png"
  ];
  static List<String>knowYourDoctorTitles =[
    "ايمن بن نشوان","رشا جاد","بيان الجفري","حسن أبكر","وسام عبدالله","محمد باحسين",
    "فيصل بالبيد","حسين بامشموس","شريف زمزم","عبدالقادر فطيم","حنان صالح", "مجدي بولص",
    "رحاب المأمون","عبدالله بايزيد","أحمد أبكر","محمد الجيلاني", "نجاة باقتادة",
    "مروى عبدالهادي","هشام بامقا","عزيز خوجه",
  ];
  static List<String>knowYourDoctorDepartments=[
    "أسنان","أسنان","أسنان","أسنان","أسنان","أسنان","أسنان","أسنان","تقويم","تقويم",
    "أطفال","أطفال","طوارئ","طوارئ","طوارئ","أسنان","نساء وولادة","الجلدية والتجميل",
    "العظام","العيون",
  ];
  static List<String>knowYourDoctorSpecialists=[
    "أسنان عام","أخصائي اسنان","اسنان","اسنان","اسنان","أسنان عام","أسنان عام",
    "أسنان عام"," أخصائي تقويم","أخصائي تقويم","اخصائية أطفال","باطنية وصدرية",
    " طب عام"," طب عام"," طب عام","أسنان عام"," اخصائية نساء وولادة","أخصائية جلدية وتجميل",
    " استشاري العظام"," استشاري عيون",
  ];

  static List<String>knowYourDoctorDegree=[
    " بكالريوس طب وجراحة الفم والاسنان"," بكالريوس طب وجراحة الفم والاسنان"," بكالريوس طب وجراحة الفم والاسنان",
    " بكالريوس طب وجراحة الفم والاسنان"," بكالريوس طب وجراحة الفم والاسنان"," بكالريوس طب وجراحة الفم والاسنان",
    " بكالريوس طب وجراحة الفم والاسنان"," بكالريوس طب وجراحة الفم والاسنان"," بكالريوس طب وجراحة الفم والاسنان"," بكالريوس طب وجراحة الفم والاسنان",
    "بكالريوس في الطب العام","بكالريوس طب وجراحة الفم والاسنان", "بكالريوس في الطب العام","بكالريوس طب عام",
    " بكالريوس طب عام"," بكالريوس طب وجراحة الفم والاسنان","حاصل على بكالريوس في الطب العام والجراحة"," حاصل على بكالريوس في الطب العام والجراحة",
    " حاصل على بكالريوس طب وجراحة العظام"," حاصل على بكالريوس في الطب العام",
  ];
  static List<String>knowYourDoctorWorkDays=[
    "من السبت الى الأربعاء ( من 2م : 10 م) .. الخميس من ( 9 ص : 5 م ) .. الجمعة إجازة",
    "من الاحد للخميس ( من 9ص : 1 م ) … الجمعة والسبت إجازة",
    "من السبت الى الخميس من ( 2م : 10 م )",
    "من السبت الى الأربعاء من ( 9ص : 12 م ) ومن ( 5 م : 10 م ) الخميس ( 2 م : 10 م ) الحمعة أجازة)",
    "من السبت الى الأربعاء من ( 2 م : 10 م ) .. الخميس ( 8.30 ص : 12 م ) … الجمعة إجازة",
    "من السبت الى الأربعاء من ( 9 ص : 12 م ) .. ومن ( 5 م : 10 م ) … الخميس من( 1 م : 9 م ) … الجمعة إجازة",
    "من السبت الى الأربعاء منمن السبت الى الخميس ( 10 ص : 5 م ) .. الجمعة إجازة",
    "من السبت الى الأربعاء من ( 3 م : 11 م ) .. الخميس من ( 9 ص: 5 م) .. الجمعة إجازة",
    "من السبت الى الأربعاء ( 2 م : 9 م ) .. الخميس من ( 10 ص : 2 م ) ..الجمعة إجازة",
    "من السبت الى الأربعاء من ( 3 م : 10 م ) ..الخميس ( 9ص : 5 م ) …الجمعة إجازة",
    "من السبت الى الأربعاء من ( 3 م : 10 م ) ..الخميس ( 9ص : 5 م ) …الجمعة إجازة",
    " من السبت الى الأربعاء من ( 9ص : 1 م ) ( 5 م : 10 م ) .. الخميس من ( 9ص : 5 م ) .. الجمعة إجازة",
    "",
    "على حسب الجدول",
    "على حسب الجدول",
    "من السبت الى الأربعاء (من 2م : 10 م ) .. الخميس أجازة .. الجمعه من ( 4 م : 10 م )",
    "من السبت الى الأربعاء من ( 2 م : 10 م ) .. الخميس من ( 9ص : 5 م ) .. الجمعة إجازة",
    "من السبت الى الأربعاء من ( 9ص : 12 م ) ومن ( 5 م : 10 م ) ... الخميس ( 9 ص : 5 م ) ... الجمعة إجازة",
    "الاثنين والخميس فقط من (9ص : 12 م ) ومن ( 5 م : 10 م )",
    "من السبت الى الخميس من ( 7 م : 10 م )",
  ];

  // about Balghsoon Clinics
  static List <String> aboutBalghsoonClinicsTitles =[
    "رسالتنا","رؤيتنا","","خدمة الزيارة المنزلية","الغذاء والنظام الغذائى","تشخيص دقيق",
  ];
  static List <String> aboutBalghsoonClinicsSubtitles =[
    "تهدف عائلة بلغصون الى تقديم خدمات عالية الجودة والاتقان ضمن مقاييس علمية لخدمة المريض وتوعية المجتمع",
    "ان نصبح مستشفى صحية رائدة في جميع التخصصات في عام 2020 متكونة من 500 سرير .. 20% من سعتها للحالات الخيرية",
    "",
    "يمكنك طلب زيارة منزلية لاحد اطبائنا او طاقم التمريض للحجز.",
    "يقوم اخصائي التغذية بالتخطيط لكم النظام الغذائي متكامل و الذي يرتكز علي اسس عمية حسب الاحتياجات العلاجية لكل حالة علي حد الحجز",
    "لدينا متخصصون فى جميع أنواع الأقسام على أعلى مستوى من الدرجة العلمية",
  ];
  static List <String> aboutBalghsoonClinicsImages =[
    "assets/images/About Balghsoon Clinics/1.png",
    "assets/images/About Balghsoon Clinics/2.png",
    "",
    "assets/images/About Balghsoon Clinics/3.png",
    "assets/images/About Balghsoon Clinics/4.png",
    "assets/images/About Balghsoon Clinics/5.png",
  ];

  //Time table data

  static   List<List<String>> timeTableData =[
    ["السبت","قسم الباطنة والصدرية","9 am - 1 pm ","د/مجدي بولص"],
    ["السبت","قسم الجلدية والتجميل","9 am - 12 pm ","د/مروى عبدالهادي"],
    ["السبت","قسم الأسنان","9 am - 5 pm","د/محمد باحسين"],
    ["السبت","قسم الأسنان","9 am - 12:30 pm ","د/شيماء عبدالعليم"],
    ["السبت","قسم الأطفال","9 am - 12 pm ","د/حنان صالح"],
    ["السبت","قسم الأسنان","10 am - 5 pm  ","د/فيصل بالبيد"],
    ["السبت","قسم الأسنان","2 pm - 10 pm","د/شريف زمزم"],
    ["السبت","قسم الأسنان","9 am - 1 pm ","د/وسام عبلله"],
    ["السبت","قسم النساء والولادة","2 pm - 10 pm","د/نجاة باقتادة"],
    ["السبت","قسم الأسنان","3 pm - 10 pm ","د/عبدالقادر فطيم"],
    ["السبت","قسم الأسنان","5 pm - 10:30 pm ","د/شيماء عبدالعليم"],
    ["السبت","الاشعة","5 pm - 10 pm ","د/راضي باجبير"],
    ["السبت","المختبر","5 pm - 10 pm ","د/زينب جاد"],
    ["السبت","قسم الأسنان","5 pm - 10 pm ","د/محمد باحسين"],
    ["السبت","قسم الجلدية والتجميل","5 pm - 10 pm ","د/مروى عبدالهادي"],
    ["السبت","قسم العيون","7 pm - 10 pm","د/عزيز خوجه"],
    ["السبت","قسم الباطنة والصدرية","5 pm - 10pm","د/مجدي بولص"],
    ["السبت","قسم الأطفال","5 pm - 10pm","د/حنان صالح"],

    ["الاحد","قسم الباطنة والصدرية","9 am - 1 pm ","د/مجدي بولص"],
    ["الاحد","قسم الجلدية والتجميل","9 am - 12 pm ","د/مروى عبدالهادي"],
    ["الاحد","قسم الأسنان","9 am - 12 pm","د/محمد باحسين"],
    ["الاحد","قسم الأسنان","9 am - 12 pm ","د/حسن أبكر"],
    ["الاحد","قسم الأسنان","9 am - 12:30 pm ","د/شيماء عبدالعليم"],
    ["الاحد","قسم الأطفال","9 am - 12 pm ","د/حنان صالح"],
    ["الاحد","قسم الأسنان","10 am - 5 pm  ","د/فيصل بالبيد"],
    ["الاحد","قسم الأسنان","10 am - 1 pm","د/ازدهار بلغصون"],
    ["الاحد","قسم الأسنان","2 pm - 9 pm ","د/شريف زمزم"],
    ["الاحد","قسم النساء والولادة","2 pm - 10 pm","د/نجاة باقتادة"],
    ["الاحد","قسم الأسنان","2 pm - 10 pm ","د /وسام عبلله"],
    ["الاحد","قسم الأسنان","2 pm - 10 pm ","د/محمد الجيلاني \n د/ايمن بن نشوان\n د/بيان الجفري"],
    ["الاحد","قسم الأسنان","3 pm - 11 pm  ","د/حسين بامشموس"],
    ["الاحد","قسم الأسنان","3 pm - 10 pm ","د/عبدالقادر فطيم"],
    ["الاحد","قسم الأسنان","5 pm - 10:30 pm ","د/شيماء عبدالعليم"],
    ["الاحد","الاشعة","5 pm - 10 pm ","د/راضي باجبير"],
    ["الاحد","المختبر","5 pm - 10 pm","د/زينب جاد"],
    ["الاحد","قسم الأسنان","5 pm - 10 pm ","د/حسن أبكر"],
    ["الاحد","قسم الأسنان","5 pm - 10 pm  ","د/محمد باحسين"],
    ["الاحد","قسم الجلدية والتجميل","5 pm - 10 pm ","د/مروى عبدالهادي"],
    ["الاحد","قسم العيون","7 pm - 10 pm ","د/عزيز خوجه"],
    ["الاحد","قسم الباطنة والصدرية","5 pm - 10pm","د/مجدي بولص"],
    ["الاحد","قسم الأطفال","5 pm - 10pm","د/حنان صالح"],

    ["الاثنين","قسم الباطنة والصدرية","9 am - 1 pm ","د/مجدي بولص"],
    ["الاثنين","قسم الجلدية والتجميل","9 am - 12 pm ","د/مروى عبدالهادي"],
    ["الاثنين","قسم الأسنان","9 am - 12 pm","د/محمد باحسين"],
    ["الاثنين","قسم الأسنان","9 am - 12 pm ","د/حسن أبكر"],
    ["الاثنين","قسم الأسنان","9 am - 12:30 pm ","د/شيماء عبد العليم"],
    ["الاثنين","قسم العظام","9 am - 12 pm ","د/هشام بامقا"],
    ["الاثنين","قسم الأطفال","9 am - 12 pm ","د/حنان صالح"],
    ["الاثنين","قسم الأسنان","10 am - 5 pm  ","د/فيصل بالبيد"],
    ["الاثنين","قسم الأسنان","10 am - 1 pm ","د/ازدهار بلغصون"],
    ["الاثنين","قسم الأسنان","2 pm - 9 pm","د/شريف زمزم"],
    ["الاثنين","قسم النساء والولادة","2 pm - 10 pm","د/نجاة باقتادة"],
    ["الاثنين","قسم الأسنان","2 pm - 10 pm ","د /وسام عبلله  \nد/محمد الجيلاني \n د/ايمن بن نشوان\n د/بيان الجفري"],
    ["الاثنين","قسم الأسنان","3 pm - 11 pm  ","د/حسين بامشموس"],
    ["الاثنين","قسم الأسنان","3 pm - 10 pm ","د/عبدالقادر فطيم"],
    ["الاثنين","قسم الأسنان","5 pm - 10:30 pm ","د/شيماء عبدالعليم"],
    ["الاثنين","الاشعة","5 pm - 10 pm ","د/راضي باجبير"],
    ["الاثنين","المختبر","5 pm - 10 pm ","د/زينب جاد"],
    ["الاثنين","قسم الأسنان","5 pm - 10 pm ","د/محمد باحسين"],
    ["الاثنين","قسم الجلدية والتجميل","5 pm - 10 pm ","د/مروى عبدالهادي"],
    ["الاثنين","قسم العظام","5 pm - 10 pm ","د/هشام بامقا"],
    ["الاثنين","قسم العيون","7 pm - 10 pm","د/عزيز خوجه"],
    ["الاثنين","قسم الباطنة والصدرية","5 pm - 10pm","د/مجدي بولص"],
    ["الاثنين","قسم الأطفال","5 pm - 10pm","د/حنان صالح"],

    ["الثلاثاء","قسم الباطنة والصدرية","9 am - 1 pm ","د/مجدي بولص"],
    ["الثلاثاء","قسم الأطفال","9 am - 12 pm ","د/حنان صالح"],
    ["الثلاثاء","قسم الأسنان","9 am - 12 pm ","د/حسن أبكر"],
    ["الثلاثاء","قسم الأسنان","9 am - 12 pm ","د/محمد باحسين"],
    ["الثلاثاء","قسم الجلدية والتجميل","9 am - 12 pm ","د/مروى عبدالهادي"],
    ["الثلاثاء","قسم الأسنان","9 am - 12:30 pm ","د/شيماء عبدالعليم"],
    ["الثلاثاء","قسم الأسنان","10 am - 1 pm ","د/ازدهار بلغصون"],
    ["الثلاثاء","قسم الأسنان","10 am - 5 pm  ","د/فيصل بالبيد"],
    ["الثلاثاء","قسم الأسنان","2 pm - 10 pm ","د /وسام عبلله  \nد/محمد الجيلاني \n د/ايمن بن نشوان\n د/بيان الجفري"],
    ["الثلاثاء","قسم الأسنان","2 pm - 9 pm","د/شريف زمزم"],
    ["الثلاثاء","قسم النساء والولادة","2 pm - 10 pm","د/نجاة باقتادة"],
    ["الثلاثاء","قسم الأسنان","3 pm - 11 pm ","د/حسين بامشموس"],
    ["الثلاثاء","قسم الأسنان","3 pm - 10 pm ","د/عبدالقادر فطيم"],
    ["الثلاثاء","قسم الأسنان","5 pm - 10:30 pm ","د/شيماء عبدالعليم"],
    ["الثلاثاء","الاشعة","5 pm - 10 pm ","د/راضي باجبير"],
    ["الثلاثاء","المختبر","5 pm - 10 pm ","د/زينب جاد"],
    ["الثلاثاء","قسم الأسنان","5 pm - 10 pm ","د/حسن أبكر"],
    ["الثلاثاء","قسم الأسنان","5 pm - 10 pm ","د/محمد باحسين"],
    ["الثلاثاء","قسم الجلدية والتجميل","5 pm - 10 pm ","د/مروى عبدالهادي"],
    ["الثلاثاء","قسم العيون","7 pm - 10 pm","د/عزيز خوجه"],
    ["الثلاثاء","قسم الباطنة والصدرية","5 pm - 10pm","د/مجدي بولص"],
    ["الثلاثاء","قسم الأطفال","5 pm - 10pm","د/حنان صالح"],

    ["الأربعاء","قسم الباطنة والصدرية","9 am - 1 pm ","د/مجدي بولص"],
    ["الأربعاء","قسم الأسنان","9 am - 12 pm ","د/حسن أبكر"],
    ["الأربعاء","قسم الأسنان","9 am - 12:30 pm ","د/شيماء عبدالعليم"],
    ["الأربعاء","قسم الأطفال","9 am - 12 pm ","د/حنان صالح"],
    ["الأربعاء","قسم الجلدية والتجميل","9 am - 12 pm ","د/مروى عبدالهادي"],
    ["الأربعاء","قسم الأسنان","9 am - 12 pm ","د/محمد باحسين"],
    ["الأربعاء","قسم الأسنان","10 pm - 5 pm  ","د/فيصل بالبيد"],
    ["الأربعاء","قسم الأسنان","10 am - 1 pm ","د/ازدهار بلغصون"],
    ["الأربعاء","قسم الأسنان","2 pm - 10 pm ","د /وسام عبلله  \nد/محمد الجيلاني \n د/ايمن بن نشوان\n د/بيان الجفري"],
    ["الأربعاء","قسم الأسنان","2 pm - 9 pm","د/شريف زمزم"],
    ["الأربعاء","قسم النساء والولادة","2 pm - 10 pm","د/نجاة باقتادة"],
    ["الأربعاء","قسم الأسنان","3 pm - 11 pm ","د/حسين بامشموس"],
    ["الأربعاء","قسم الأسنان","3 pm - 10 pm ","د/عبدالقادر فطيم"],
    ["الأربعاء","قسم الأسنان","5 pm - 10:30 pm ","د/شيماء عبدالعليم"],
    ["الأربعاء","الاشعة","5 pm - 10 pm ","د/راضي باجبير"],
    ["الأربعاء","المختبر","5 pm - 10 pm ","د/زينب جاد"],
    ["الأربعاء","قسم الجلدية والتجميل","5 pm - 10 pm ","د/مروى عبدالهادي"],
    ["الأربعاء","قسم الأسنان","5 pm - 10 pm ","د/حسن أبكر"],
    ["الأربعاء","قسم الأسنان","5 pm - 10 pm ","د/محمد باحسين"],
    ["الأربعاء","قسم العيون","7 pm - 10 pm","د/عزيز خوجه"],
    ["الأربعاء","قسم الباطنة والصدرية","5 pm - 10pm","د/مجدي بولص"],
    ["الأربعاء","قسم الأطفال","5 pm - 10pm","د/حنان صالح"],

    ["الخميس","قسم الأسنان","8:30 am - 12 pm ","د /وسام عبلله"],
    ["الخميس","قسم الأسنان","9 am - 5 pm ","د/شيماء عبدالعليم \n د/ايمن بن نشوان\n د/حسين بامشموس \n د/عبدالقادر فطيم"],
    ["الخميس","قسم الأطفال","9 am - 12 pm ","د/حنان صالح"],
    ["الخميس","قسم الباطنة والصدرية","9 am - 5 pm ","د/مجدي بولص"],
    ["الخميس","قسم النساء والولادة","9 am - 5 pm","د/نجاة باقتادة"],
    ["الخميس","قسم الجلدية والتجميل","9 am - 5 pm ","د/مروى عبدالهادي"],
    ["الخميس","قسم العظام","9 am - 12 pm ","د/هشام بامقا"],
    ["الخميس","قسم الأسنان","10 am - 1 pm ","د/ازدهار بلغصون"],
    ["الخميس","قسم الأسنان","10 pm - 5 pm  ","د/فيصل بالبيد"],
    ["الخميس","قسم الأسنان","10 am - 2 pm","د/شريف زمزم"],
    ["الخميس","قسم الأسنان","1 pm - 9 pm ","د/محمد باحسين"],
    ["الخميس","قسم الأسنان","2 pm - 10 pm ","د/بيان الجفري"],
    ["الخميس","قسم الأسنان","2 pm - 10 pm ","د/حسن أبكر"],
    ["الخميس","الاشعة","5 pm - 10 pm ","د/راضي باجبير"],
    ["الخميس","المختبر","5 pm - 10 pm ","د/زينب جاد"],
    ["الخميس","قسم العظام","5 pm - 10 pm ","د/هشام بامقا"],
    ["الخميس","قسم العيون","7 pm - 10 pm","د/عزيز خوجه"],
    ["الخميس","قسم الأطفال","5 pm - 10pm","د/حنان صالح"],

    ["الجمعة","قسم الأسنان","4 pm - 10 pm ","د/محمد الجيلاني"],

  ];

  static List<String> increaseInformationAboutDoctors =[
    "حاصل على بكالريوس طب وجراحة الفم والاسنان من جامعة 6 أكتوبر عام 2005 م .. الخبرات السابقة في مستشفى القصر العيني حتى عام 2008 م .. دورات في علاج ( علاج العصب والتركيبات الثابتة والمتحركة ) .. الخدمات التي يقدمها (( الحشو – التركيبات الثابتة والمتحركة – تنظيف الاسنان – تبييض الاسنان – علاج العصب – الخلع البسيط – خلع جراحي – خلع للاطفال – علاج العصب للاطفال |))",
    "بكالريوس في طب وجراحة الفم والاسنان من جامعة البنجاب ( كلية ديمونت مورينسي لطب الاسنان ) عام 1998 م .. حاصلة على دورة في جراحة الاسنان .. حاصلة على دورة في علاج العصب في جنوه .. عضو في الجمعية السعودية لطب الاسنان .. الخبرات السابقة (( في مستشفى البنجاب بباكستان - مستشفى السلامة فيصل التخصصي بجدة - مركز الاستشارات الطبية بجدة -- مركز ديما لطب الاسنان بالرياض )) .. الخدمات التي تقدمها (( جميع خدمات علاج عصب الاسنان - الحشوات التجميلية -- تركيبات الزيركون والبورسلاين والايماكس - الخلع البسيط - الخلغ الجراحي - تنظيف الاسنان - تبييض الاسنان - تطبيق الفورايد للاسنان اللبنية ))",
    "بكالريوس طب وجراحة الفم والاسنان من جامعة الملك عبدالعزيز .. حاصلة على دورة في علاج العصب - وحاصلة على دورة في الفينيرز - ودورة في الحشوات التجميلية للااسنا )) ..الخبرات السابقة (( عملت في مستشفى الحرس الوطني - مستشفى الملك عبدالعزيز الجامعي - مستشفى الملك فهد العسكري- مستشفى الملك فهد العام )) .. الخدمات التي تقدمها (( تنظيف الاسنان - تبييض الاسنان - الحشوات التجميلية - التركيبات - الخلع - علاج العصب ))",
    "حاصل على بكالريوس طب وجراحة الفم والأسنان من جامعة صنعاء عام 2012 م .. عمل في مستشفى الكويت الجامعي ومستشفى العلوم والتكنولوجيا بصنعاء .. حاصل على دورات في ( الجراحة العامة - علاج الجذور - العلاج التحفظي ) .. الخدمات التي يقدمها (( جميع الحشوات - تنظيف اسنان - التركيبات الثابتة والمتحركة - تبييض الاسنان - ابتسامة هوليوود -الخلع ))",
    "حاصل على بكالريوس طب وجراحة الفم والاسنان من جامعة صنعاء عام 2013 م .. حاصلة على كاجيستير في طب الاسنان تخصص تقويم اسنان من جامعة مونستر الألمانية .. شهادة حصور دورة تصميم ابتسامة هوليوود في جدة .. شهادة في الإسعافات الأولية في الإنعاش القلبي من جمعية القلب السعودية ( مستشفى كلية ابن سينا للعلوم الصحية في جدة ) .. شهادة في تجميل الاسنان .. شهادة مشاركة في ورشة عمل تدريبية لتجميل الاسنان .. الخدمات التي تقدمها (( الحشوات العادية - الحشوات التجميلية بكل انواعها - تلبيسات - تركيب الجسور بكل انواعها - تركيب العدسات وقشور الاسنان - علاج اللثة - خلع - علاج العصب - حشوات وعلاج اعصاب للاطفال ))",
    "حاصل على بكالريوس في طب وجراحة الفم والاسنان من جامعة الحديدة باليمن عام 2011 .. حاصل على دورة في علاج العصب .. حاصل على دورة في العلاج التحفظي .. حاصل على شهادة المشاركة في بحوث في جامعة الملك عبدالعزيز كلية طب الاسنان وبرامج خدمة المجتمع .. عمل في جامعة الملك عبدالعزيز حتى عام 2014 .. الخدمات التي يقدمها (( تنظيف اسنان - خلع بسيط - خلع جراحي - حلع سن مضمور - علاج العصب - تركيبة البورسلاين - الحشوات - التلبيسات ))",
    "حاصل على بكالريوس طب وجراحة الفم والاسنان من جامعة العلوم والتكنولوجيا الأردنية عام 2010 م .. حاصل على دبلوم زراعة الاسنان من كلية ابن سينا .. عمل في مستشفى جامعة الملك عبدالله بالأردن .. عمل في مركز طب الاسنان في ( اربد )  .. وعمل في عيادات الصقر في عسير .. الخدمات التي يقدمها (( الحشو - الخلع البسيط - الخلع الجراحي - تركيبات الزيركون والبورسلاين - علاج العصب تنظيف الاسنان - التلبيسات ))",
    "حاصل على بكالريوس في طب وجراحة الفم والاسنان من جامعة دبنروبتروفسك  بأوكرانيا عام 1997 م ... حاصل على شهادة الماجيستير في تقويم الأسنان عام 2000 م .. الخدمات التي يقدمها (( تقويم الأسنان - زراعة الأسنان - تجميل الاسنان ))",
    "حاصل على بكالريوس في طب وجراحة الفم والاسنان من جامعة بنجلور عام 2001 م ..حاصل على دبلوم عالي في علاج الاسنان من المعهد العالي لطب الاسنان عام 2002 م ...وحاصل على شهادة الماجيستير في تقويم الاسنان من جامعة (( ووهان )) بالهند عام 2010م ... وعضو في الجمعية السعودية لتقويم الاسنان .. عضو في الجمعية الامريكية لتقويم الاسنان ..زميل الاتحاد الدولي لتقويم الاسنان .. الخدمات التي يقدمها (( تقويم وتجميل الاسنان ))",
    "بكالريوس الطب العام من جامعة دمشق عام 2002 م .. شهادة اختصاص في طب الأطفال والمواليد من جامعة دمشق .. إجازة من هيئة البورد العربي للتخصصات الصحية .. شهادة خبرة من مستشفيات الهيئة الملكية في السعودية ..شهادة خبرة من مستشفى جامعة الملك عبدالعزيز - شهادة خبرة من الادارة الطبية في جامعة الملك عبدالعزيز - شهادة خبرة في علاج المواليد وحديثي الولادة من مستشيات الهيئة الملكية )) .. الخدمات التي تقدمها (( تشخيص وعلاج الامراض الهضمية والتنفسية للاطفال - علاج الربو وامراض الحساسية - مراقبة نمو ووزن الطفل - تشخيص وعلاج امراض المواليد والخدج وحديثي الولادة - علاج حروق الاطفال - علاج الامراض الباطنية للاطفال والتجفاف - علاج نقص الشهية ونقص الوزن وتراجع النمو عند الاطفال - علاج البدانة عند الاطفال - اعطاء كافة التطعيمات لدى الاطفال حسب جدول الصحة السعودية - علاج مشاكل تاخر التسنين والمشي عند الرضع ))",
    "حاصل على بكالريوس في الطب العام والجراحة من جامعة الإسكندرية عام 1981م .. حاصل على دبلوم في الامراض الصدرية والربو .. ماجيستير قلب واوعية دموية .. عضو في الجمعية السعودية للسكر .. خبره 28 عام في طب الباطنية .. الخدمات التي يقدمها (( تشخيص وعلاج جميع امراض الباطنية - علاج الربو - علاج الغدد الصماء - علاج الغدة الدرقية - علاج الكوليسترول - تشخيص وعلاج الامراض الصدرية -تشخيص وعلاج امراض الجهاز الهضمي والكبد - ))",
    "حاصلة على بكالريوس في الطب العام من جامعة  كلوج  برومانيا عام 1998 م . .",
    "حاصل على بكالريوس طب وجراحة الفم والاسنان من جامعة 6 أكتوبر عام 2005 م .. الخبرات السابقة في مستشفى القصر العيني حتى عام 2008 م .. دورات في علاج ( علاج العصب والتركيبات الثابتة والمتحركة ) .. الخدمات التي يقدمها (( الحشو – التركيبات الثابتة والمتحركة – تنظيف الاسنان – تبييض الاسنان – علاج العصب – الخلع البسيط – خلع جراحي – خلع للاطفال – علاج العصب للاطفال |))",
    "حاصل على بكالريوس في الطب العام من جامعة العلوم والتكنولوجيا بصنعاء عام 2005 م .. عمل في مستشفى تابع للجهات الحكومية حتى عام 2007",
    "حاصل على بكالريوس طب وجراحة الفم والاسنان من جامعة 6 أكتوبر عام 2005 م .. الخبرات السابقة في مستشفى القصر العيني حتى عام 2008 م .. دورات في علاج ( علاج العصب والتركيبات الثابتة والمتحركة ) .. الخدمات التي يقدمها (( الحشو - التركيبات الثابتة والمتحركة - تنظيف الاسنان - تبييض الاسنان - علاج العصب - الخلع البسيط - خلع جراحي - خلع للاطفال - علاج العصب للاطفال |))",
    "حاصل على بكالريوس في الطب العام والجراحة من جامعة عدن عام 2000م ... وحاصل على ماجيستير في طب النساء والولادة من جامعة أسيوط بمصر عام 2009 م ... وحاصل على شهادة الماجيستير في تصوير امراض الاجنة وامراض النساء .. حاصل على دورات في ( موانع الحمل - دورة في تركيب غرسات الحمل ) .. الخدمات التي تقدمها (( متابعة الحمل والولادة -- تشخيص وعلاج امراض النساء والولادة ))",
    "حاصل على بكالريوس في الطب والجراحة عام 2004 م من جامعة القاهرة .. حاصل على شهادة الدراسات العليا في الامراض الجلدية والتناسلية من جامعة القاهرة .. ماجيستير في الامراض الجلدية والتجميل والليزر عام 2010 م .. دبلومة التجميل والليزر والبوتكس والفيلر من جامعة القاهره .. الخدمات التي تقدمها (( استشارات جلدية - علاج حب الشباب - علاج الصدفية - علاج البهاق - العلاج بالليزر- تعبئة الوجه بالفيلر - حقن البوتكس للتجاعيد وزيادة التعرق - توريد الشفايف بالبلازما او الفيلر - علاج التصبغات واثار حب الشباب - علاج ندبات حب الشباب - علاج تساقط الشعر بالميزوثيرابي والخلايا الجذعية - علاج تساقط الشعر بالبلازما ))",
    "حاصل على بكالريوس طب وجراحة العظام من جامعة الملك فيصل بالسعودية عام 1998 م .. حاصل على الزمالة الفرنسية لجراحة عظام الأطفال .. حاصل على الزمالة السعودية لجراحة العظام .. عضو في الجمعية الفرنسية لجراحة العظام .. عضو جمعية أمريكا الشمالية لجراحة عظام الاطفال ..استشاري جراحة عظام الاطفال بالمركز الطبي الدولي سابقا .. المدير الطبي ورئيس قسم جراحة العظام بمستشفى القوات المسلحة بالهدا سابقا ...استاذ مساعد اكلينكي كلية الطب بجامعة الطائف سابقا .. الخدمات التي يقدمها للاطفال (( خلع الورك التطوري - تشوهات الاقدام - تقوس الساقين - تشوه المفاصل مع الشد العضلي بسبب الشلل الدماغي - اورام عظام وعضلات الاطفال - القدم المفلطحة - قصر القامة - اختلال المشي - الاطراف الصناعية - العمليات في المستشفى الكبرى )) .. الخدمات التي يقدمها للكبار (( الاصابات الرياضية - خشونة المفاصل - الم الظهر المزمن - تحسين قدرة وكفاءة الجهازالعضلي العظمي -العلاج الطبيعي في المراكز المحلية - امكانية تنسيق العمليات والعلاج الطبيعي في مراكز اوروبية معتمدة ))",
    "حاصل على بكالريوس في الطب العام من جامعة إسطنبول عام 1985 م .. وحصل على شهادة الاستشارية في تخصص العيون بأنقرة .. عمل في المستشفى العسكري بمدينة ادنة حتى عام 1991 .. وعمل في احدي مستشفياات وزارة الصحة بتبوك حتى عام 2002 م .. الخدمات التي يقدمها (( تشخيص امراض مقدمة العين وعلاجها - تشخيص وعلاج الماء الازرق - تشخيص امراض عيون الاطفال والحول والعين الكسرية وعلاجها - تشخيص امراض اعصاب العين وعلاجها - تشخيص الاعتلال الشبكي والسكري وعلاج المياه البيضاء ))",
  ];

//  Drawer

  static List<String> drawerTitles =[
    "الرئيسية","اعرف طبيبك","الاقسام","الجدول","الاخبار",
    "العروض","اتصل بنا","عن عيادات بلغصون",
  ];
  static List<String> drawerImages =[
    "assets/images/Drawer/1.png","assets/images/Drawer/2.png","assets/images/Drawer/3.png",
    "assets/images/Drawer/4.png","assets/images/Drawer/5.png","assets/images/Drawer/6.png",
    "assets/images/Drawer/7.png","assets/images/Drawer/8.png",
  ];
  static List<int> nonAvailablePages =[4,5];
  static List<String> navigate =[
    '/Home','/KnowYourDoctor','/Departments','/TimeTable',
    '/LastNews','/Offers','/CallUs','/AboutBalghsoonClinics',
  ];
  static var snackBarKey =GlobalKey<ScaffoldState>();
  static void navigateToPage (int position , BuildContext context) {
    if (nonAvailablePages.contains(position)){
      snackBarKey.currentState.showSnackBar(SnackBar(
            content: Text("Coming Soon in new updates"),
            duration: Duration(seconds: 2),
          ));
    }
    else {
          Navigator.pushNamed(context, navigate[position]);
      }
  }
  static Widget myDrawer (){
    return ListView.builder(
      itemBuilder: (BuildContext context,int position){
        return (position==0)
            ?new Image.asset("assets/images/logo.png",height: 200,width: 200,)
            :new ListTile(
          onTap: ()=>navigateToPage(position-1,context),
          trailing: new Image.asset(drawerImages[position-1],width: 30,height: 30,),
          title: new Row(
            mainAxisAlignment: MainAxisAlignment.end,
            crossAxisAlignment:  CrossAxisAlignment.end,
            children: <Widget>[
              Text(drawerTitles[position-1]),
            ],
          ),
        );
      },
      itemCount: drawerTitles.length+1,
    );
  }


}